; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	thermograph3 - mode
	spectrograph2 - mode
	spectrograph4 - mode
	infrared1 - mode
	infrared0 - mode
	image7 - mode
	thermograph6 - mode
	image5 - mode
	Star2 - direction
	Star0 - direction
	Star1 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared1)
	(supports instrument1 image7)
	(supports instrument1 thermograph6)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument3 image5)
	(supports instrument3 spectrograph2)
	(supports instrument3 infrared1)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 Star5)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon12)
)
(:goal (and
	(pointing satellite1 Planet8)
	(have_image Phenomenon6 thermograph3)
	(have_image Star7 image7)
	(have_image Planet8 image7)
	(have_image Planet8 spectrograph2)
	(have_image Planet9 image5)
	(have_image Planet9 thermograph3)
	(have_image Phenomenon10 infrared0)
	(have_image Phenomenon10 spectrograph4)
	(have_image Star11 infrared1)
	(have_image Phenomenon12 spectrograph4)
))

)

; plan
1. (turn_to satellite2 star5 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star5)
   goals met: 0 of 11
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 11
3. (calibrate satellite2 instrument3 star5)
   added: (calibrated instrument3)
   goals met: 0 of 11
4. (turn_to satellite2 phenomenon6 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 phenomenon6)
   goals met: 0 of 11
5. (take_image satellite2 phenomenon6 instrument3 thermograph3)
   added: (have_image phenomenon6 thermograph3)
   goals met: 1 of 11
6. (turn_to satellite2 phenomenon10 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon10)
   goals met: 1 of 11
7. (turn_to satellite0 star0 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star0)
   goals met: 1 of 11
8. (take_image satellite2 phenomenon10 instrument3 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 2 of 11
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 11
10. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 2 of 11
11. (turn_to satellite0 phenomenon10 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 11
12. (take_image satellite0 phenomenon10 instrument0 spectrograph4)
   added: (have_image phenomenon10 spectrograph4)
   goals met: 3 of 11
13. (turn_to satellite0 phenomenon12 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 11
14. (take_image satellite0 phenomenon12 instrument0 spectrograph4)
   added: (have_image phenomenon12 spectrograph4)
   goals met: 4 of 11
15. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 11
16. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 11
17. (turn_to satellite0 star1 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star1)
   goals met: 4 of 11
18. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 4 of 11
19. (turn_to satellite0 planet8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet8)
   goals met: 4 of 11
20. (take_image satellite0 planet8 instrument1 image7)
   added: (have_image planet8 image7)
   goals met: 5 of 11
21. (turn_to satellite0 star11 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star11)
   goals met: 5 of 11
22. (take_image satellite0 star11 instrument1 infrared1)
   added: (have_image star11 infrared1)
   goals met: 6 of 11
23. (turn_to satellite0 star7 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star7)
   goals met: 6 of 11
24. (take_image satellite0 star7 instrument1 image7)
   added: (have_image star7 image7)
   goals met: 7 of 11
25. (turn_to satellite1 planet8 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet8)
   goals met: 8 of 11
26. (turn_to satellite2 planet8 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 planet8)
   goals met: 8 of 11
27. (take_image satellite2 planet8 instrument3 spectrograph2)
   added: (have_image planet8 spectrograph2)
   goals met: 9 of 11
28. (turn_to satellite2 planet9 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 planet9)
   goals met: 9 of 11
29. (take_image satellite2 planet9 instrument3 image5)
   added: (have_image planet9 image5)
   goals met: 10 of 11
30. (take_image satellite2 planet9 instrument3 thermograph3)
   added: (have_image planet9 thermograph3)
   goals met: 11 of 11
